In [15]:
import numpy as np
import matplotlib.pyplot as plt    
import seaborn as sns

In [11]:
df = pd.read_csv("Data/sample_submission.csv")
print(df.head(10))

       id  exam_score
0  630000           0
1  630001           0
2  630002           0
3  630003           0
4  630004           0
5  630005           0
6  630006           0
7  630007           0
8  630008           0
9  630009           0

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 270000 entries, 0 to 269999
Data columns (total 2 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id          270000 non-null  int64
 1   exam_score  270000 non-null  int64
dtypes: int64(2)
memory usage: 4.1 MB

In [13]:
sns.set(style="whitegrid")

In [14]:
df.isna().sum().sum()

0

In [10]:
df.dropna()

            id  exam_score
0       630000           0
1       630001           0
2       630002           0
3       630003           0
4       630004           0
...        ...         ...
269995  899995           0
269996  899996           0
269997  899997           0
269998  899998           0
269999  899999           0

[270000 rows x 2 columns]

In [11]:
df.duplicated().sum()

0

In [12]:
import warnings

warnings.filterwarnings("ignore")

In [13]:
df.describe()

                  id  exam_score
count  270000.000000    270000.0
mean   764999.500000         0.0
std     77942.430678         0.0
min    630000.000000         0.0
25%    697499.750000         0.0
50%    764999.500000         0.0
75%    832499.250000         0.0
max    899999.000000         0.0

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 270000 entries, 0 to 269999
Data columns (total 2 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id          270000 non-null  int64
 1   exam_score  270000 non-null  int64
dtypes: int64(2)
memory usage: 4.1 MB

In [15]:
import numpy as np

In [18]:
df_train = pd.read_csv("/media/bumble/DATA_DISK/dk/python/Predicting-Student-Test-Scores/Data/train.csv")

In [19]:
df_train.describe()

,id,age,study_hours,class_attendance,sleep_hours,exam_score
count,630000.000000,630000.000000,630000.000000,630000.000000,630000.000000,630000.000000
mean,314999.500000,20.545821,4.002337,71.987261,7.072758,62.506672
std,181865.479132,2.260238,2.359880,17.430098,1.744811,18.916884
min,0.000000,17.000000,0.080000,40.600000,4.100000,19.599000
25%,157499.750000,19.000000,1.970000,57.000000,5.600000,48.800000
50%,314999.500000,21.000000,4.000000,72.600000,7.100000,62.600000
75%,472499.250000,23.000000,6.050000,87.200000,8.600000,76.300000
max,629999.000000,24.000000,7.910000,99.400000,9.900000,100.000000

In [20]:
df_train.head()

,id,age,gender,course,study_hours,class_attendance,internet_access,sleep_hours,sleep_quality,study_method,facility_rating,exam_difficulty,exam_score
0,0,21,female,b.sc,7.91,98.8,no,4.9,average,online videos,low,easy,78.3
1,1,18,other,diploma,4.95,94.8,yes,4.7,poor,self-study,medium,moderate,46.7
2,2,20,female,b.sc,4.68,92.6,yes,5.8,poor,coaching,high,moderate,99.0
3,3,19,male,b.sc,2.00,49.5,yes,8.3,average,group study,high,moderate,63.9
4,4,23,male,bca,7.65,86.9,yes,9.6,good,self-study,high,easy,100.0

In [21]:
import matplotlib.pyplot as plt